---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Allow
enum: Autodesk.Revit.DB.Analysis.AllowLargeGeometry
source: html/4b5a3532-d4f3-4cc3-ca7f-d75cb3ba719f.htm
---
# Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Allow

Allow export/path of travel creation on large geometries.